<?php

include ('connection.php');
include ('head.php');
?>

                <div class="article">
				    <h1>Мои увлечения</h1>
				</div>
                <hr class="line">
                <div class="article">
                    <h1>Лабораторные работы по Дискретной Математике:</h1>
                    <br><a href="lab1.php">Лаборатораня работа №1 : Операции над множествами</a><br><br>
                    <a href="lab2.php">Лаборатораня работа №2 : Свойства бинарных отношений (в виде матрицы)</a><br><br>
                    <a href="lab3.php">Лаборатораня работа №3 : Функция (Матрица)</a><br><br>
                    <a href="lab4.php">Лаборатораня работа №4 : Поиск кратчайшего пути в графе(алгоритм Флойда-Уоршэлла)</a><br><br>
                    <a href="lab5.php">Лаборатораня работа №5 : Поиск матрицы достижимости</a><br>
				 </div>
                 <hr class="line">
				 <div class="content">
					 <p class="article">В свободное время я предпочитаю не страдать от безделья, а посему стараюсь занять себя чем-то. Ниже приведу некоторые из моих деяний. Раздел будет потихоньку пополняться.</p>
					 <h1 class="article">Сборка/мелкий ремонт компьютерной техники и переферии</h1>
					 <hr class="line">
					 <div class="pics">
                         <img src="images/pay.jpg" alt="перепайка инвертера питания старого монитора">
                         <p>Восстановление старого монитора (перепайка мертвого инвертера питания)</p>
                         <img src="images/comp.jpg" alt="моя предыдущая сборка">
                         <p>Сборка домашнего компьютера на базе чипсета AMD 760G. Дальнейшие эксперименты с разгоном переросли в колхоз: попытки улучшить охлаждение фаз VRM. В результате частоту удалось поднять до стабильных 3.9 ГГц, но, поскольку чипсет не позволяет вручную изменять значения вольтажа как на процессоре, так и на мостах, это был предел, пусть старичок FX-6100 и  способен на гораздо большее.  </p>
                         <img src="images/comp1.jpg" alt="компьютер для друга">
                         <p>Пример рациональной сборки домашнего компьютера в сильно урезанном бюджете (30 килорупий) - сентябрь 2016 г.</p>
                         <p class="article">В данный момент сижу на весьма интересной связке: i5 2500 с алиэкспресса по смешной цене (который, к слову,исправно работает и спокойно выдерживает часовой тест ОССТ и линпака) + GTX 950. 270-ый радик, к сожалению, сгорел сразу после истечения гарантийного срока.</p>

					 </div>
					 
				 </div>
			</div>
			<div class="underground">
                <h2 id="underarticle">Авторские права</h2>
				<p>Copyright © 2017. Официальный сайт Мартынова Егора.</p>
				<address>
                Связаться со мной вы всегда можете по e-mail: e.martinow@yandex.ru, 
                либо на сайте vk.com: https://vk.com/martinow111
                </address>
            </div>
        </div>
	</body>
</html>